Services/src/Documents/РегистрацияИТС/РегистрацияИТС.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document>
  <name>РегистрацияИТС</name>
  <registerRecords>AccumulationRegister.РегистрацияИТСОбороты</registerRecords>
  <registerRecords>InformationRegister.С_РегистрацияИТС</registerRecords>
  <attributes>
    <name>Комментарий</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>200</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ПутьКФайлу</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>Ответственный</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>300</length>
      </stringQualifiers>
    </type>
  </attributes>
  <tabularSections>
    <name>ИТС</name>
    <attributes>
      <name>ИНН</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>20</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>РегистрационныйНомер</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>30</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ДатаС</name>
      <type>
        <types>Date</types>
        <dateQualifiers>
          <dateFractions>Date</dateFractions>
        </dateQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ДатаПо</name>
      <type>
        <types>Date</types>
        <dateQualifiers>
          <dateFractions>Date</dateFractions>
        </dateQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>РучнойВвод</name>
      <type>
        <types>Boolean</types>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Document>

Services/src/CommonModules/С_ОбновлениеРегистрацииИТССервер/Module.bsl
Процедура ОбновлениеИТС() Экспорт
	
	Попытка		
				
		ПервыйФайл = Неопределено;
		Второйфайл = Неопределено;
		
		ПрочитатьПочту(ПервыйФайл, ВторойФайл);
		
		Если ПервыйФайл = Неопределено Тогда
			Возврат;
		КонецЕсли;
		
		ТаблицаИТС = Новый ТаблицаЗначений;
		ТаблицаИТС.Колонки.Добавить("РегистрационныйНомер", Новый ОписаниеТипов("Строка"));
		ТаблицаИТС.Колонки.Добавить("Пользователь", Новый ОписаниеТипов("Строка"));
		ТаблицаИТС.Колонки.Добавить("ИНН", Новый ОписаниеТипов("Строка"));
		ТаблицаИТС.Колонки.Добавить("Инн10", Новый ОписаниеТипов("Строка"));
		ТаблицаИТС.Колонки.Добавить("ДатаС", Новый ОписаниеТипов("Дата"));
		ТаблицаИТС.Колонки.Добавить("ДатаПо", Новый ОписаниеТипов("Дата"));
		
		ТаблицаИТСД = Новый ТаблицаЗначений;
		ТаблицаИТСД.Колонки.Добавить("РегистрационныйНомер", Новый ОписаниеТипов("Строка"));
		ТаблицаИТСД.Колонки.Добавить("Пользователь", Новый ОписаниеТипов("Строка"));
		ТаблицаИТСД.Колонки.Добавить("ИНН", Новый ОписаниеТипов("Строка"));
		ТаблицаИТСД.Колонки.Добавить("Инн10", Новый ОписаниеТипов("Строка"));
		ТаблицаИТСД.Колонки.Добавить("ДатаС", Новый ОписаниеТипов("Дата"));
		ТаблицаИТСД.Колонки.Добавить("ДатаПо", Новый ОписаниеТипов("Дата"));
		
	
		ПрочитатьФайлы(ПервыйФайл, ТаблицаИТС, ТаблицаИТСД);
		
		Если Второйфайл <> Неопределено Тогда
			ПрочитатьФайлы(Второйфайл, ТаблицаИТС, ТаблицаИТСД);
		КонецЕсли;			
					
		ТаблицаИТС.Свернуть("РегистрационныйНомер,ИНН,ДатаС,ДатаПо");
		
		НачатьТранзакцию();
		ЗаписатьВРегистр(ТаблицаИТС);
		ЗафиксироватьТранзакцию();
		
		
		Профиль = новый ИнтернетПочтовыйПрофиль;
		Профиль.АдресСервераSMTP = "mail.1c-minsk.by";
		Профиль.ПользовательSMTP ="serv_its@1c-minsk.by";
		Профиль.ПарольSMTP ="ServiceITS16";
		Профиль.ПортSMTP = 25;
		Профиль.АдресСервераSMTP = СпособSMTPАутентификации.Login;
		
		Почта = Новый ИнтернетПочта;
		
		Письмо = Новый ИнтернетПочтовоеСообщение;
		Текст = Письмо.Тексты.Добавить("Загрузка файлов ИТС");
		Текст.ТипТекста = ТипТекстаПочтовогоСообщения.ПростойТекст;
		Письмо.Тема = "Загрузка файлов ИТС!"; 
		Письмо.Отправитель = "serv_its@1c-minsk.by";
		Письмо.ИмяОтправителя = "Загрузка файлов ИТС";
		//Письмо.Получатели.Добавить("1cServic@mail.ru");
		Письмо.Получатели.Добавить("savo@1c-minsk.by");
		Письмо.Получатели.Добавить("inna.scorpio@gmail.com");
		
		Почта.Подключиться(Профиль);
		Почта.Послать(Письмо);
		Почта.Отключиться();

		
		
	Исключение
		Если ТранзакцияАктивна() Тогда
			ОтменитьТранзакцию();
		КонецЕсли;
		
		Профиль = новый ИнтернетПочтовыйПрофиль;
		Профиль.АдресСервераSMTP = "mail.1c-minsk.by";
		Профиль.ПользовательSMTP ="serv_its@1c-minsk.by";
		Профиль.ПарольSMTP ="ServiceITS16";
		Профиль.ПортSMTP = 25;
		Профиль.АдресСервераSMTP = СпособSMTPАутентификации.Login;
		
		Почта = Новый ИнтернетПочта;
		
		Письмо = Новый ИнтернетПочтовоеСообщение;
		Текст = Письмо.Тексты.Добавить(ОписаниеОшибки());
		Текст.ТипТекста = ТипТекстаПочтовогоСообщения.ПростойТекст;
		Письмо.Тема = "Загрузка файлов ИТС!"; 
		
		Письмо.Отправитель = "serv_its@1c-minsk.by";
		Письмо.ИмяОтправителя = "Загрузка файлов ИТС";
		//Письмо.Получатели.Добавить("1cServic@mail.ru");
		Письмо.Получатели.Добавить("savo@1c-minsk.by");
		Письмо.Получатели.Добавить("inna.scorpio@gmail.com");

		
		Почта.Подключиться(Профиль);
		Почта.Послать(Письмо);
		Почта.Отключиться();
		
	КонецПопытки;	
	
КонецПроцедуры

Процедура ПрочитатьПочту(ПервыйФайл, ВторойФайл)
	
	Профиль = Новый ИнтернетПочтовыйПрофиль;
	Профиль.АдресСервераPOP3 = "mail.1c-minsk.by";
	Профиль.АдресСервераSMTP = "mail.1c-minsk.by";
	Профиль.ПортPOP3 = 110;
	Профиль.ПортSMTP = 25;
	Профиль.Пользователь ="serv_its@1c-minsk.by";
	Профиль.Пароль = "ServiceITS16";
	Почта = Новый ИнтернетПочта;
	Почта.Подключиться(Профиль);
	МассивСообщений = Почта.Выбрать(Ложь);
	
	Если МассивСообщений.Количество() = 0 Тогда
		Возврат;
	КонецЕсли;
	
	
	Для Индекс = 0 По МассивСообщений.Количество() - 1 Цикл  		
		
		Тема = "ИТС";
		Если МассивСообщений[Индекс].Тема = Тема Тогда
			Попытка
				ПервыйФайл = ПолучитьИмяВременногоФайла("xlsx");
				ВторойФайл = ПолучитьИмяВременногоФайла("xlsx");
				МассивСообщений[Индекс].Вложения[0].Данные.Записать(первыйФайл);
				
				Если  МассивСообщений[Индекс].Вложения.Количество() = 2 Тогда
					МассивСообщений[Индекс].Вложения[1].Данные.Записать(второйфайл);
				Иначе
					второйфайл  = неопределено;
				КонецЕсли;
				
				МассивУдаляемыхСообщений = Новый Массив;
				МассивУдаляемыхСообщений.Добавить(МассивСообщений[Индекс]);

				Почта.УдалитьСообщения(МассивУдаляемыхСообщений);	
			Исключение
				Возврат;
			КонецПопытки;
		КонецЕсли;
		
	КонецЦикла;
	
	Почта.Отключиться();
	
КонецПроцедуры

Процедура ПрочитатьФайлы(ИмяВременногоФайла, ТаблицаИТС, ТаблицаИТСД)
	
	
	ТабличныйДокумент = Новый ТабличныйДокумент;
	
	ТабличныйДокумент.Прочитать(ИмяВременногоФайла, СпособЧтенияЗначенийТабличногоДокумента.Значение);    
	
	КолвоСтрокФайла = ТабличныйДокумент.ВысотаТаблицы;
	КонечнаяКолонка = ТабличныйДокумент.ПолучитьОбласть().ШиринаТаблицы;
	
	Если КолвоСтрокФайла = 0 Тогда
		ТабличныйДокумент = Неопределено;
	КонецЕсли;
	
		
	ТекстПартнер = Ложь;
	ТекстПартнер = ТабличныйДокумент.ПолучитьОбласть("R4C1").ТекущаяОбласть.Текст = "Партнер";
	
	Если  ТекстПартнер Тогда
		
		Для счCтр =  5 по КолвоСтрокФайла Цикл
			
			счСтр = СоКрЛП(СтрЗаменить(счCтр, Символы.НПП, ""));
			
			РегНомер =  СокрЛП(ТабличныйДокумент.ПолучитьОбласть("R" + счСтр + "C3").ТекущаяОбласть.Текст);
			Пользователь =  СокрЛП(ТабличныйДокумент.ПолучитьОбласть("R" + счСтр + "C4").ТекущаяОбласть.Текст);
			ИНН =  СокрЛП(ТабличныйДокумент.ПолучитьОбласть("R" + счСтр + "C5").ТекущаяОбласть.Текст);     
			Инн10 = "";
			Если СтрДлина(ИНН) >9 И Лев(ИНН,1)  = "0" Тогда
				Инн10 = ИНН;
				ДлинаИНН = СтрДлина(ИНН)-1;
				ИНН = Прав(Инн, ДлинаИНН);
			КонецЕсли;
			
			ДатаНачалаТекст =  СокрЛП(ТабличныйДокумент.ПолучитьОбласть("R" + счСтр + "C7").ТекущаяОбласть.Текст);
			ДатаОкончанияТекст =  СокрЛП(ТабличныйДокумент.ПолучитьОбласть("R" + счСтр + "C8").ТекущаяОбласть.Текст);
			
			ДатаС = Дата(Прав(ДатаНачалаТекст, 4)+ Сред(ДатаНачалаТекст,4,2) + Лев(ДатаНачалаТекст, 2)); 
			ДатаПо = Дата(Прав(ДатаОкончанияТекст, 4)+ Сред(ДатаОкончанияТекст,4,2) + Лев(ДатаОкончанияТекст, 2)); 
			
			Дополнительно =    СокрЛП(ТабличныйДокумент.ПолучитьОбласть("R" + счСтр + "C22").ТекущаяОбласть.Текст);
			МассивРегНомеров = Новый Массив;
			Если Дополнительно <> "" Тогда
				
				КоличествоСтрок =  СтрЧислоВхождений(Дополнительно, ";");
				ДополнительноСтр = СтрЗаменить(Дополнительно, ";", Символы.ВК);
				
				Для сч = 1 по КоличествоСтрок+1  Цикл
					МассивРегНомеров.Добавить(СтрПолучитьСтроку(ДополнительноСтр,сч));			
				КонецЦикла;
				
			КонецЕсли;
			
			
			НоваяСтрока =  ТаблицаИТС.Добавить();
			НоваяСтрока.РегистрационныйНомер =   РегНомер;
			НоваяСтрока.Пользователь =  Пользователь;
			НоваяСтрока.ИНН =  ИНН;
			НоваяСтрока.Инн10 =  Инн10;
			НоваяСтрока.ДатаС =  ДатаС;
			НоваяСтрока.ДатаПо =  ДатаПо;
			
			Если МассивРегНомеров.Количество() > 0 Тогда
				
				Для каждого текСт Из МассивРегНомеров Цикл
					НоваяСтрока =  ТаблицаИТСД.Добавить();
					НоваяСтрока.РегистрационныйНомер =  текСт;
					НоваяСтрока.Пользователь =  Пользователь;
					НоваяСтрока.ИНН =  ИНН;
					НоваяСтрока.Инн10 =  Инн10;
					НоваяСтрока.ДатаС =  ДатаС;
					НоваяСтрока.ДатаПо =  ДатаПо;
				КонецЦикла; 
				
			КонецЕсли;	
			
		КонецЦикла;	
		
		
		Для каждого текСтрока  Из ТаблицаИТСД  Цикл
			
			Отбор = Новый Структура;
			Отбор.Вставить("ИНН",текСтрока.ИНН);
			Отбор.Вставить("РегистрационныйНомер",текСтрока.РегистрационныйНомер);
			
			МассивСтрок = ТаблицаИТС.НайтиСтроки(Отбор);
			
			Если МассивСТрок.Количество() = 0 Тогда
				СтрокаТИТС = ТаблицаИТС.Добавить();
				ЗаполнитьЗначенияСвойств(СтрокаТИТС, текСтрока);
			КонецЕсли;
			
		КонецЦикла; 
		
	КонецЕсли;
	
	Для каждого тексСтр из  ТаблицаИТС Цикл
		тексСтр.ИНН = СтрЗАменить(СтрЗАменить(тексСтр.Инн, Символы.НПП, ""), " ", "");
		тексСтр.РегистрационныйНомер = СтрЗАменить(СтрЗаменить(тексСтр.РегистрационныйНомер, Символы.НПП,""), " ", "");
	КонецЦикла;
	
	
	
КонецПроцедуры	

Процедура ЗаписатьВРегистр(ТаблицаИТС)
	
	Док = Документы.РегистрацияИТС.НайтиПоНомеру("000000001");
	ДокОбъект =   Док.ПолучитьОбъект();
	ДокОбъект.Дата = ТекущаяДата();
	ДокОбъект.ИТС.Очистить();
	ДокОбъект.ИТС.Загрузить(ТаблицаИТС);
	ДокОбъект.Записать(РежимЗаписиДокумента.Проведение);
		
КонецПроцедуры
